Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Breakpoint hit" &message
zh_cn: "断点命中"消息(&M)

source: "Changed on server" conflicts
zh_cn: "在服务器的变更" 冲突

source: "Save" button in the Export dialog saves results to the path specified, "Copy" copies the whole text to the clipboard.
zh_cn: 导出对话框的 "Save" 按钮将结果保存至指定的路径，"Copy" 将整个文本复制到剪贴板。

source: "javadoc" finished with exit code $EXIT_CODE$
zh_cn: "javadoc" 完成，退出码 $EXIT_CODE$

source: "reached {0}"
zh_cn: "到达 {0}"

source: "{0}" Exists, Replace?
zh_cn: "{0}" 已存在，替换？

source: "{0}" is not a directory.
zh_cn: "{0}" 不是一个目录。

source: "{0}" not found
zh_cn: "{0}" 未找到

source: "{0}"@{1} in group "{3}": {2}
zh_cn: "{0}"@{1} 在组 "{3}": {2} 中

source: $val fields as local &variables
zh_cn: $val 字段为本地变量(&V)

source: &Add
zh_cn: 添加(&A)

source: &Add silently
zh_cn: 静默地添加(&A)

source: &Add...
zh_cn: 添加...(&A)

source: &Additional information (steps to reproduce, what were you doing when the exception occurred):
zh_cn: 附加信息(当发生异常时,你的操作步骤是):(&A)

source: &After
zh_cn: 之后(&A)

source: &Alias:
zh_cn: 别名:(&A)

source: &All
zh_cn: 全部(&A)

source: &All Files
zh_cn: 所有文件(&A)

source: &All files in directory {0}
zh_cn: 目录 {0} 中的所有文件(&A)

source: &All invocations in project
zh_cn: 项目中的所有调用(&A)

source: &Allow unsigned requests
zh_cn: 允许未签名的请求(&A)

source: &Always
zh_cn: 总是(&A)

source: &Applet class
zh_cn: Applet 类(&A)

source: &Apply
zh_cn: 应用(&A)

source: &As is
zh_cn: 作为(&A)

source: &Attach...
zh_cn: 附加...(&A)

source: &Background
zh_cn: 后台(&B)

source: &Backward
zh_cn: 向后(&B)

source: &Base directory:
zh_cn: 基本目录:(&B)

source: &Before
zh_cn: 之前(&B)

source: &Before launch
zh_cn: 启动前(&B)

source: &Browse ...
zh_cn: 浏览 ...(&B)

source: &Cancel
zh_cn: 取消(&C)

source: &Case sensitive
zh_cn: 区分大小写(&C)

source: &Change usages of {0} to:
zh_cn: 改变 {0} 使用为:(&C)

source: &Check Now
zh_cn: 立即检查(&C)

source: &Class:
zh_cn: 类:(&C)

source: &Classpath:
zh_cn: 类路径:(&C)

source: &Clear
zh_cn: 清除(&C)

source: &Clear all
zh_cn: 清除全部(&C)

source: &Close
zh_cn: 关闭(&C)

source: &Close message view if no error occurred
zh_cn: 如果没有发生错误，关闭消息视图(&C)

source: &Command line arguments for running remote JVM
zh_cn: 用于运行远程 JVM 的命令行参数(&C)

source: &Comment:
zh_cn: 注释:(&C)

source: &Commit
zh_cn: 提交(&C)

source: &Commit Message
zh_cn: 提交信息(&C)

source: &Condition:
zh_cn: 条件:(&C)

source: &Configure VCS...
zh_cn: 配置 VCS...(&C)

source: &Configure...
zh_cn: 配置...(&C)

source: &Continue
zh_cn: 继续(&C)

source: &Convert Project
zh_cn: 转换项目(&C)

source: &Convert to functional expression
zh_cn: 转换为函数表达式(&C)

source: &Copy
zh_cn: 复制(&C)

source: &Copy ''{0}'' library files to
zh_cn: 复制 ''{0}'' 库文件到(&C)

source: &Copy text to clipboard
zh_cn: 将文本复制到剪贴板(&C)

source: &Create
zh_cn: 创建(&C)

source: &Create new module
zh_cn: 创建新模块(&C)

source: &Create source directory
zh_cn: 创建源码目录(&C)

source: &Custom scope
zh_cn: 自定义范围(&C)

source: &Debug
zh_cn: 调试(&D)

source: &Default License Server
zh_cn: 默认许可证服务器(&D)

source: &Delete
zh_cn: 删除(&D)

source: &Delete Anyway
zh_cn: 仍然删除(&D)

source: &Delete local copies of added files
zh_cn: 删除添加文件的本地副本(&D)

source: &Delete variable declaration
zh_cn: 删除变量声明(&D)

source: &Derived classes
zh_cn: 派生类(&D)

source: &Derived interfaces
zh_cn: 派生接口(&D)

source: &Description:
zh_cn: 描述:(&D)

source: &Detach
zh_cn: 分离(&D)

source: &Directory
zh_cn: 目录(&D)

source: &Disable
zh_cn: 禁用(&D)

source: &Disable plugin...
zh_cn: 禁用插件...(&D)

source: &Do Refactor
zh_cn: 执行重构(&D)

source: &Do Replace Al&&l
zh_cn: 全部替换(&D)

source: &Do not add
zh_cn: 不要添加(&D)

source: &Do not create source directory
zh_cn: 不要创建源码目录(&D)

source: &Do not show this message in the future
zh_cn: 以后不再显示此消息(&D)

source: &Drop obsolete casts
zh_cn: 删除废弃的转换(&D)

source: &Duplicate Line
zh_cn: 重复行(&D)

source: &Duplicate Selection
zh_cn: 重复所选(&D)

source: &Duplicate keys with different values
zh_cn: 重复的键有不同值(&D)

source: &Edit
zh_cn: 编辑(&E)

source: &Edit Configurations
zh_cn: 编辑配置(&E)

source: &Edit variables
zh_cn: 编辑变量(&E)

source: &Edit...
zh_cn: 编辑...(&E)

source: &Enable XML/HTML Emmet
zh_cn: 启用 XML Emmet(&E)

source: &Enable capturing form snapshots
zh_cn: 启用捕获表单快照(&E)

source: &Enable capturing form snapshots (requires JRE 5.0 or higher)
zh_cn: 启用捕获表单快照(需要 JRE 5.0或更高版本)(&E)

source: &Encoding:
zh_cn: 编码：(&E)

source: &Environment variables
zh_cn: 环境变量(&E)

source: &Error message
zh_cn: 错误消息((&E)

source: &Escalate
zh_cn: 升级(&E)

source: &Evaluate and log:
zh_cn: 计算和日志:(&E)

source: &Evaluate for free for {0} days
zh_cn: 免费评估 {0} 天(&E)

source: &Exclude
zh_cn: 排除(&E)

source: &Expression:
zh_cn: 表达式:(&E)

source: &External Schemas and DTDs
zh_cn: 外部模式和 DTDs(&E)

source: &Field name:
zh_cn: 字段名：(&F)

source: &File scope
zh_cn: 文件范围(&F)

source: &File {0}
zh_cn: 文件 {0}(&F)

source: &Finish
zh_cn: 完成(&F)

source: &Fix
zh_cn: 修复(&F)

source: &Flatten packages
zh_cn: 拼合包(&F)

source: &Fold parameters
zh_cn: 折叠参数(&F)

source: &From
zh_cn: 从(&F)

source: &Generate annotations
zh_cn: 生成注释(&G)

source: &Get access
zh_cn: 获取访问(&G)

source: &Getter template:
zh_cn: Getter 模板:(&G)

source: &Global
zh_cn: 全局(&G)

source: &Go to
zh_cn: 转到(&G)

source: &Group:
zh_cn: 组:(&G)

source: &HTML
zh_cn: HTML(&H)

source: &HTTP Proxy Settings...
zh_cn: HTTP 代理设置...(&H)

source: &Height:
zh_cn: 高度：(&H)

source: &Hide non-existent
zh_cn: 隐藏不存在的(&H)

source: &History...
zh_cn: 历史...(&H)

source: &Home:
zh_cn: 首页:(&H)

source: &Host name:
zh_cn: 主机名:(&H)

source: &Icon Path:
zh_cn: 图标路径:(&I)

source: &Ignore @PropertyKey expressions
zh_cn: 忽略 @PropertyKey 表达式(&I)

source: &Ignore Changes
zh_cn: 忽略更改(&I)

source: &Ignore This Update
zh_cn: 忽略此更新(&I)

source: &Ignore case
zh_cn: 忽略大小写(&I)

source: &Ignored Schemas and DTDs
zh_cn: 忽略模式和 DTDs(&I)

source: &Implementing classes
zh_cn: 实现类(&I)

source: &Implementing methods
zh_cn: 实现方法(&I)

source: &Import existing module
zh_cn: 导入现有模块(&I)

source: &Include
zh_cn: 包含(&I)

source: &Include into commit
zh_cn: 包含到提交里(&I)

source: &Include parent environment variables
zh_cn: 包含父环境变量(&I)

source: &Include subdirectories
zh_cn: 包含子目录(&I)

source: &Inner class name:
zh_cn: 内部类名:(&I)

source: &Insert imports on paste:
zh_cn: 粘贴时插入导入：(&I)

source: &Instance filters:
zh_cn: 实例过滤器:(&I)

source: &Interface name:
zh_cn: 接口名:(&I)

source: &JRE:
zh_cn: JRE:(&J)

source: &Keep Memory Changes
zh_cn: 保持内存的更改(&K)

source: &Language level:
zh_cn: 语言级别：(&L)

source: &Leave Object-parameterized types raw
zh_cn: 使对象参数化类型为原始(&L)

source: &Load File System Changes
zh_cn: 加载文件系统的更改(&L)

source: &Load...
zh_cn: 加载...(&L)

source: &Locale:
zh_cn: 语言环境:(&L)

source: &Log File Location:
zh_cn: 日志文件位置:(&L)

source: &Log file:
zh_cn: 日志文件:(&L)

source: &Login:
zh_cn: 登录:(&L)

source: &Main Class:
zh_cn: 主要类:(&M)

source: &Make inner class of
zh_cn: 使内部类(&M)

source: &Mark All
zh_cn: 全部标记(&M)

source: &Maximum heap size (Mb):
zh_cn: 最大堆大小 (Mb):(&M)

source: &Merge gathered coverage with suite chosen below
zh_cn: 用下面选中的套件合并覆盖率(&M)

source: &Merge...
zh_cn: 合并...(&M)

source: &Migrate
zh_cn: 迁移(&M)

source: &Min string length:
zh_cn: 最小字符串长度：(&M)

source: &Modify
zh_cn: 修改(&M)

source: &Module
zh_cn: 模块(&M)

source: &Module ''{0}''
zh_cn: 模块 ''{0}''(&M)

source: &Module SDK:
zh_cn: 模块 SDK：(&M)

source: &Module Scope
zh_cn: 模块范围(&M)

source: &Module name:
zh_cn: 模块名:(&M)

source: &Module:
zh_cn: 模块：(&M)

source: &Move
zh_cn: 移动(&M)

source: &Move changes to active changelist (''{0}'')
zh_cn: 将更改移动到活动更改列表(''{0}'')(&M)

source: &Move inner class {0} to another class
zh_cn: 移动内部类 {0} 到另一个类(&M)

source: &Name
zh_cn: 名称(&N)

source: &Name for extracted include file (default extension: {0})
zh_cn: 提取包含文件名称(默认扩展名: {0})(&N)

source: &Name of inverted {0}:
zh_cn: 反转的 {0} 的名字:(&N)

source: &Name:
zh_cn: 名称:(&N)

source: &Narrow &&down on typing
zh_cn: 在输入时缩小(&N)

source: &Narrow &&down the list on typing
zh_cn: 输入时缩小列表(&N)

source: &Narrow down the list on typing
zh_cn: 缩小键入的列表(&N)

source: &Never
zh_cn: 从不(&N)

source: &New name:
zh_cn: 新名称:(&N)

source: &New...
zh_cn: 新建...(&N)

source: &Next
zh_cn: 下一个(&N)

source: &Next Tip
zh_cn: 下一提示(&N)

source: &No
zh_cn: 否(&N)

source: &Normalize
zh_cn: 标准化(&N)

source: &OK
zh_cn: 确定(&O)

source: &Open Project Structure after import
zh_cn: 导入后打开项目结构(&O)

source: &Optimize imports
zh_cn: 优化导入(&O)

source: &Other command line arguments:
zh_cn: 其他命令行参数:(&O)

source: &Output directory:
zh_cn: 输出目录:(&O)

source: &Overwrite Modified File
zh_cn: 覆盖修改过的文件(&O)

source: &Overwrite Modified Files
zh_cn: 覆盖修改过的文件(&O)

source: &Package for new interface:
zh_cn: 新接口的包:(&P)

source: &Package for new superclass:
zh_cn: 新的超类的包:(&P)

source: &Package for original class:
zh_cn: 原始类的包:(&P)

source: &Package for original interface:
zh_cn: 原始接口的包:(&P)

source: &Package{0}
zh_cn: 包 {0}(&P)

source: &Pass count:
zh_cn: 通过数：(&P)

source: &Password:
zh_cn: 密码:(&P)

source: &Patch file name:
zh_cn: 补丁文件名称:(&P)

source: &Patch file:
zh_cn: 补丁文件:(&P)

source: &Path to executable
zh_cn: 可执行文件的路径(&P)

source: &Pattern:
zh_cn: 模式:(&P)

source: &Perform commit to VCS in background
zh_cn: 在后台执行提交到 VCS(&P)

source: &Policy file:
zh_cn: 策略文件:(&P)

source: &Port:
zh_cn: 端口:(&P)

source: &Preserve case
zh_cn: 保留大小写(&P)

source: &Preview
zh_cn: 预览(&P)

source: &Preview Replacement
zh_cn: 预览更换(&P)

source: &Preview usages to be changed
zh_cn: 预览要改变的用法(&P)

source: &Previous
zh_cn: 上一个(&P)

source: &Previous Tip
zh_cn: 上一提示(&P)

source: &Profile:
zh_cn: 配置文件:(&P)

source: &Project Scope
zh_cn: 项目范围(&P)

source: &Properties File:
zh_cn: 属性文件:(&P)

source: &Rearrange entries
zh_cn: 重新排序条目(&R)

source: &Reassign wildcard
zh_cn: 重分配通配符(&R)

source: &Record previous module names
zh_cn: 记录以前的模块名称(&R)

source: &Recursive matching
zh_cn: 递归匹配(&R)

source: &Refactor
zh_cn: 重构(&R)

source: &Reformat according to style
zh_cn: 根据样式重新格式化(&R)

source: &Reformat code
zh_cn: 重新格式化代码(&R)

source: &Remember
zh_cn: 记住(&R)

source: &Remember, don't ask again
zh_cn: 记住，不再询问(&R)

source: &Remind Me Later
zh_cn: 稍后提醒我(&R)

source: &Remove
zh_cn: 移除(&R)

source: &Rename original class to:
zh_cn: 重命名原始类为:(&R)

source: &Replace
zh_cn: 替换(&R)

source: &Replace Selected
zh_cn: 替换所选项(&R)

source: &Replace all fields
zh_cn: 替换所有字段(&R)

source: &Replace with delegation inheritance from:
zh_cn: 替换为委托继承从：(&R)

source: &Replace{0,choice,0#|1#|2# {0} Occurrences}
zh_cn: 替换{0,choice,0#|1#|2# {0} 匹配项}(&R)

source: &Report suspicious but possibly correct method calls
zh_cn: 报告可疑但可能正确的方法调用(&R)

source: &Report to JetBrains
zh_cn: 报告给 JetBrains(&R)

source: &Rerun Safe Delete
zh_cn: 重新运行安全删除(&R)

source: &Rerun Type Migration
zh_cn: 返回类型迁移(&R)

source: &Reset
zh_cn: 重置(&R)

source: &Result:
zh_cn: 结果:(&R)

source: &Retry
zh_cn: 重试(&R)

source: &Reverse patch
zh_cn: 反转补丁(&R)

source: &Revert Changes
zh_cn: 还原更改(&R)

source: &Review
zh_cn: 回顾(&R)

source: &Run Inspection by Name...
zh_cn: 按名称运行检查...(&R)

source: &Save ''{0}'' Configuration
zh_cn: 保存 ''{0}'' 配置(&S)

source: &Save...
zh_cn: 保存...(&S)

source: &Scope
zh_cn: 范围(&S)

source: &Search in comments and strings
zh_cn: 在注释和字符串中搜索(&S)

source: &Search:
zh_cn: 搜索:(&S)

source: &Selected text
zh_cn: 所选文本(&S)

source: &Send
zh_cn: 发送(&S)

source: &Set Default...
zh_cn: 默认设置...(&S)

source: &Set access
zh_cn: 设置访问(&S)

source: &Set icon
zh_cn: 设置图标(&S)

source: &Setter template:
zh_cn: Setter 模板:(&S)

source: &Share
zh_cn: 分享(&S)

source: &Show Errors
zh_cn: 显示错误(&S)

source: &Show all files coverable by pattern
zh_cn: 显示所有符合模式的文件(&S)

source: &Show difference
zh_cn: 显示差异(&S)

source: &Show files with the same names as nested according to the rules below
zh_cn: 根据下面的规则显示与嵌套名称相同的文件(&S)

source: &Show inherited members
zh_cn: 显示继承的成员(&S)

source: &Skip
zh_cn: 跳过(&S)

source: &Skip This File
zh_cn: 跳过该文件(&S)

source: &Socket
zh_cn: Socket(&S)

source: &Specify...
zh_cn: 指定...(&S)

source: &Start
zh_cn: 开始(&S)

source: &Static fields
zh_cn: 静态字段(&S)

source: &Stop Searching
zh_cn: 停止搜索(&S)

source: &Strip leading directories
zh_cn: 剥离主要目录(&S)

source: &Super class name:
zh_cn: 超类名:(&S)

source: &Superclass name:
zh_cn: 超类名:(&S)

source: &Suspend
zh_cn: 暂停(&S)

source: &Suspend:
zh_cn: 暂停:(&S)

source: &Template text:
zh_cn: 模板文本:(&T)

source: &Template:
zh_cn: 模板:(&T)

source: &Test kind:
zh_cn: 测试类型：(&T)

source: &This Window
zh_cn: 当前窗口(&T)

source: &Thread
zh_cn: 线程(&T)

source: &To:
zh_cn: 到:(&T)

source: &Transform
zh_cn: 转换(&T)

source: &URL
zh_cn: URL(&U)

source: &Uncommitted files
zh_cn: 未提交的文件(&U)

source: &Unload >
zh_cn: 卸载 >(&U)

source: &Unmark All
zh_cn: 全部取消标记(&U)

source: &Unscramble stacktrace
zh_cn: 解码堆栈跟踪(&U)

source: &Unselect all
zh_cn: 取消全选(&U)

source: &Update
zh_cn: 更新(&U)

source: &Update and Restart
zh_cn: 更新并重启(&U)

source: &Update and Shutdown
zh_cn: 更新并关闭(&U)

source: &Usages
zh_cn: 使用(&U)

source: &Use ''{0}'' from {1} distribution
zh_cn: 使用 {1} 分发中的 ''{0}''(&U)

source: &Use accessors even when field is accessible
zh_cn: 使用访问器即使字段是可访问的(&U)

source: &Use interface/superclass in instanceof
zh_cn: 在 instanceof 中使用接口/超类(&U)

source: &Username:
zh_cn: 用户名:(&U)

source: &VCS
zh_cn: VCS(&V)

source: &VM options for appletviewer:
zh_cn: appletviewer 的 VM 选项：(&V)

source: &VM options:
zh_cn: 虚拟机选项：(&V)

source: &Value tooltip delay (ms):
zh_cn: 值工具提示延迟(毫秒)：(&V)

source: &View Source
zh_cn: 查看源代码(&V)

source: &View Usages
zh_cn: 查看使用(&V)

source: &Visibility:
zh_cn: 可见性:(&V)

source: &Whole project
zh_cn: 整个项目(&W)

source: &Width:
zh_cn: 宽度:(&W)

source: &Working directory:
zh_cn: 工作目录：(&W)

source: &XML
zh_cn: XML(&X)

source: &Yes
zh_cn: 是(&Y)

source: &productName; has analyzed which of its features you are using and has found some that you have probably missed.
zh_cn: &productName; 分析了你正使用的一些功能，并查找你可能错过的功能。

source: &productName; lets you jump from your check-in comment to an issue in your task tracker.
zh_cn: &productName; 允许你从检入的注释中跳转到任务跟踪器中的问题。

source: &setUp method
zh_cn: SetUp 方法(&S)

source: &shortcut:EditorMoveToPageTop; in a commander panel goes on level up to the parent.
zh_cn: &shortcut:EditorMoveToPageTop; 在命令面板向上跳转至父一级。

source: '#ref()' call can be replaced with parametrized constructor call
zh_cn: '#ref()' 可以用参数化的构造函数替换

source: ''@{0}'' not applicable to {1}
zh_cn: ''@{0}'' 不适用于 {1}

source: ''boolean'' value expected in condition
zh_cn: 表达式期望 ''boolean'' 值

source: ''null'' argument usages for parameter {0}
zh_cn: ''null'' 实参的使用对于形参 {0}

source: ''package-info.java'' already exists for package ''{0}''
zh_cn: ''package-info.java'' 已经存在于包 ''{0}'' 内

source: ''{0}'' API is requested.
zh_cn: 请求 ''{0}'' API 。

source: ''{0}'' Inspection on {1}
zh_cn: ''{0}'' 对 {1} 检查

source: ''{0}'' Profile on {1}
zh_cn: ''{0}'' 配置于 {1}

source: ''{0}'' already exists
zh_cn: ''{0}'' 已经存在

source: ''{0}'' already exists in VFS
zh_cn: ''{0}'' 在 VFS 已经存在

source: ''{0}'' attribute should be defined
zh_cn: ''{0}'' 属性需要定义

source: ''{0}'' cannot be applied to ''{1}''
zh_cn: ''{0}'' 不能应用于 ''{1}''

source: ''{0}'' cannot be inherited with different type arguments: ''{1}'' and ''{2}''
zh_cn: ''{0}'' 不能用不同的类型参数继承：''{1}'' 和 ''{2}''

source: ''{0}'' cannot be referenced from a static context
zh_cn: ''{0}'' 不能从静态上下文引用

source: ''{0}'' cannot override ''{1}'' in ''{2}''; overridden method is final
zh_cn: ''{0}'' 不能覆盖 ''{2}'' 中的 ''{1}'';重写方法是 final 的

source: ''{0}'' child tag should be defined
zh_cn: 应该定义 ''{0}'' 子标签

source: ''{0}'' clashes with ''{1}''
zh_cn: ''{0}'' 与 ''{1}'' 冲突

source: ''{0}'' compile output
zh_cn: ''{0}'' 编译输出

source: ''{0}'' directory contents
zh_cn: ''{0}'' 目录内容

source: ''{0}'' does not contain a project
zh_cn: ''{0}'' 不包含项目

source: ''{0}'' does not exist
zh_cn: ''{0}'' 不存在

source: ''{0}'' does not exist in VFS
zh_cn: ''{0}'' 在 VFS 不存在

source: ''{0}'' doesn''t appear to be a valid {1} installation home.
zh_cn: ''{0}'' 似乎不是一个有效的 {1} 安装路径。

source: ''{0}'' expected
zh_cn: 期望 ''{0}''

source: ''{0}'' has already configured to be launched before {1}.
zh_cn: ''{0}'' 已经被配置为在 {1} 之前启动。

source: ''{0}'' has no default constructor
zh_cn: ''{0}'' 没有默认的构造函数

source: ''{0}'' has private access in ''{1}''
zh_cn: ''{0}'' 在 ''{1}'' 中有 private 访问权限

source: ''{0}'' has protected access in ''{1}''
zh_cn: ''{0}'' 在 ''{1}'' 中 protected 访问权限

source: ''{0}'' has unsupported format
zh_cn: ''{0}'' 有不支持的格式

source: ''{0}'' has unsupported xml format.
zh_cn: ''{0}'' 有不支持的 XML 格式。

source: ''{0}'' in ''{1}'' cannot be applied to ''{2}''
zh_cn: ''{1}'' 中的 ''{0}'' 不能应用于 ''{2}''

source: ''{0}'' in ''{2}'' clashes with ''{1}'' in ''{3}''
zh_cn: ''{2}'' 中的 ''{0}'' 与 ''{3}'' 中的 ''{1}'' 冲突

source: ''{0}'' is abstract; cannot be instantiated
zh_cn: ''{0}'' 是抽象的;无法实例化

source: ''{0}'' is already defined in ''{1}''
zh_cn: ''{0}'' 已经定义在 ''{1}'' 中

source: ''{0}'' is already defined in a single-type import
zh_cn: ''{0}'' 已经在单一类型的导入中定义

source: ''{0}'' is already defined in this compilation unit
zh_cn: ''{0}'' 已经在此编译单元中定义

source: ''{0}'' is bad configured
zh_cn: ''{0}'' 是损坏的配置

source: ''{0}'' is deprecated
zh_cn: ''{0}'' 已被弃用

source: ''{0}'' is deprecated and marked for removal
zh_cn: ''{0}'' 已过时并被标记为移除

source: ''{0}'' is inaccessible here
zh_cn: ''{0}'' 在这里无法访问

source: ''{0}'' is not a concrete class
zh_cn: ''{0}'' 不是一个具体的类

source: ''{0}'' is not a directory
zh_cn: ''{0}'' 不是一个目录

source: ''{0}'' is not a directory in VFS
zh_cn: ''{0}'' 在 VFS 不是一个目录

source: ''{0}'' is not a legal FQ-name
zh_cn: ''{0}'' 不是合法的 FQ 名称

source: ''{0}'' is not a legal java identifier
zh_cn: ''{0}'' 不是合法的 java 标识符

source: ''{0}'' is not a valid JRE home
zh_cn: ''{0}'' 不是一个有效的 JRE 主目录

source: ''{0}'' is not an enclosing class
zh_cn: ''{0}'' 不是一个封闭的类

source: ''{0}'' is not an identifier.
zh_cn: ''{0}'' 不是一个标识符。

source: ''{0}'' is not assignable to ''{1}''
zh_cn: ''{0}'' 不能分配给 ''{1}''

source: ''{0}'' is not public
zh_cn: ''{0}'' 不是公共的

source: ''{0}'' is not public in ''{1}''.
zh_cn: ''{0}'' 在 ''{1}'' 中不是 public 。

source: ''{0}'' is not valid JRE home
zh_cn: ''{0}'' 不是有效的 JRE 主目录

source: ''{0}'' is single-instance run configuration.
zh_cn: ''{0}'' 是单实例运行配置。

source: ''{0}'' library not found in the module dependencies list
zh_cn: 在模块依赖列表中找不到库 ''{0}''

source: ''{0}'' may not contain objects of type ''{1}''
zh_cn: ''{0}'' 可能不包含 ''{1}'' 类型的对象

source: ''{0}'' not found.
zh_cn: ''{0}'' 未找到。

source: ''{0}'' plugin
zh_cn: ''{0}'' 插件

source: ''{0}'' plugin.
zh_cn: ''{0}'' 插件。

source: ''{0}'' run configuration is not compatible with {2, choice, 1#currently running {1} configuration.|2#following running configurations: {1}} Are you sure you want to stop {2, choice, 1#incompatible running instance|2#{2, number} incompatible running instances}?
zh_cn: ''{0}'' 运行配置与 {2, choice, 1#当前运行的 {1} 配置不兼容|2#下列运行的配置不兼容: {1}} 你确定要停止 {2, choice, 1#不兼容的运行实例吗|2#{2, number} 个不兼容的运行实例吗}?

source: ''{0}'' should have default constructor or implement ''Decorator'' pattern
zh_cn: ''{0}'' 应该有默认构造函数或实现 ''Decorator'' 模式

source: ''{0}'' should probably not be assigned to ''{1}''
zh_cn: ''{0}'' 不应该赋值给 ''{1}''

source: ''{0}'' should probably not be passed as parameter ''{1}''
zh_cn: ''{0}'' 不应该被传递为参数 ''{1}''

source: ''{0}'' should probably not be returned from method ''{1}''
zh_cn: ''{0}'' 不应该从方法 ''{1}'' 返回

source: ''{0}'' test compile output
zh_cn: ''{0}'' 测试编译输出

source: ''{0}'' with dependencies
zh_cn: ''{0}'' 有依赖关系

source: ''{0}'' with errors
zh_cn: ''{0}'' 有错误

source: ''{0}'' with no errors
zh_cn: ''{0}'' 没有任何错误

source: ''{0}()'' method can be replaced with parametrized constructor
zh_cn: ''{0}()'' 可以用参数化的构造函数替换

source: '(' expected
zh_cn: 期望 '('

source: '(' or '[' expected
zh_cn: 期望 '(' 或 '['

source: ')' expected
zh_cn: 期望 ')'

source: ',' expected
zh_cn: 期望 ','

source: ',' on next line
zh_cn: ',' 另起一行

source: ',' or ')' expected
zh_cn: 期望 ',' 或 ')'

source: ',' or ';' expected
zh_cn: 期望 ',' 或 ';'

source: '.' expected
zh_cn: 期望 '.'

source: ':' expected
zh_cn: 期望 ':'

source: ':' signs on next line
zh_cn: ':' 符号在下一行

source: ';' expected
zh_cn: 期望 ';'

source: '=' expected
zh_cn: 期望 '='

source: '>' block
zh_cn: '>' 块

source: '>' expected
zh_cn: 期望 '>'

source: '>' expected.
zh_cn: 期望 '>' 。

source: '>' or ',' expected
zh_cn: 期望 '>' 或 ','

source: '?' and ':' signs on next line
zh_cn: '?' 和 ':' 符号在下一行

source: '?>' expected
zh_cn: 期望 '?>'

source: 'Next Error' action goes to high priority problems only
zh_cn: '下一个错误' 的操作只去高优先级的问题

source: 'Node &has descendands' expression (optional):
zh_cn: '节点有子节点' 表达式 (可选):(&H)

source: '[' expected
zh_cn: 期望 '['

source: ']' expected
zh_cn: 期望 ']'

source: 'boolean' value expected in condition
zh_cn: 表达式期望 'boolean' 值

source: 'case' on new line
zh_cn: 'case' 另起一行

source: 'catch' keyword
zh_cn: 'catch' 关键字

source: 'catch' left brace
zh_cn: 'catch' 左大括号

source: 'catch' on new line
zh_cn: 'catch' 另起一行

source: 'catch' or 'finally' expected
zh_cn: 期望 'catch' 或 'finally'

source: 'catch' parentheses
zh_cn: 'catch' 括号

source: 'catch' without 'try'
zh_cn: 'catch' 没 'try'

source: 'class' or 'interface' expected
zh_cn: 期望 'class' 或 'interface'

source: 'default' and 'fixed' attributes should not be present in the same time
zh_cn: 'default' 和 'fixed' 属性不应该同时出现

source: 'do ... while()' statement
zh_cn: 'do ... while()' 语句

source: 'do' left brace
zh_cn: 'do' 左大括号

source: 'else' keyword
zh_cn: 'else' 关键字

source: 'else' left brace
zh_cn: 'else' 左大括号

source: 'else' on new line
zh_cn: 'else' 另起一行

source: 'else' without 'if'
zh_cn: 'else' 没有 'if'

source: 'finally' keyword
zh_cn: 'finally' 关键字

source: 'finally' left brace
zh_cn: 'finally' 左大括号

source: 'finally' on new line
zh_cn: 'finally' 另起一行

source: 'finally' without 'try'
zh_cn: 'finally' 没有 'try'

source: 'for' left brace
zh_cn: 'for' 左大括号

source: 'for' parentheses
zh_cn: 'for' 括号

source: 'for()' statement
zh_cn: 'for()' 语句

source: 'if' left brace
zh_cn: 'if' 左大括号

source: 'if' parentheses
zh_cn: 'if' 括号

source: 'if()' statement
zh_cn: 'if()' 语句

source: 'module-info.java' already exists in the module
zh_cn: 'module-info.java' 已经存在于模块中

source: 'opens' is not allowed in an open module
zh_cn: 在打开的模块中不允许 'opens'

source: 'requires transitive' directive for an automatic module
zh_cn: 对自动模块的 'requires transitive' 指令

source: 'requires' directive for an automatic module
zh_cn: 对自动模块的 'requires' 指令

source: 'switch' left brace
zh_cn: 'switch' 左大括号

source: 'switch' parentheses
zh_cn: 'switch' 括号

source: 'switch' statement
zh_cn: 'switch' 语句

source: 'synchronized' left brace
zh_cn: 'synchronized' 左大括号

source: 'synchronized' parentheses
zh_cn: 'synchronized' 括号

source: 'this' is not available
zh_cn: 'this' 是不可用的

source: 'try' left brace
zh_cn: 'try' 左大括号

source: 'try' parentheses
zh_cn: 'try' 括号

source: 'try' statement
zh_cn: 'try' 语句

source: 'void' type is not allowed here
zh_cn: 这里不允许使用 'void' 类型

source: 'void' type may not be annotated
zh_cn: 'void' 类型不应被注释

source: 'while' expected
zh_cn: 期望 'while'

source: 'while' keyword
zh_cn: 'while' 关键字

source: 'while' left brace
zh_cn: 'while' 左大括号

source: 'while' on new line
zh_cn: 'while' 另起一行

source: 'while' parentheses
zh_cn: 'while' 括号

source: 'while()' statement
zh_cn: 'while()' 语句

source: 'with' expected
zh_cn: 期望 'with'

source: '{' expected
zh_cn: 期望 '{'

source: '{' or ';' expected
zh_cn: 期望 '{' 或 ';'

source: '{'{0}@{5}'}'.{1} will be accessed at {2}({3}:{4,number,#})
zh_cn: '{'{0}@{5}'}' .{1} 将在 {2}({3}:{4,number,#}) 访问

source: '{'{0}@{7}'}'.{1} will be modified at {4}({5}:{6,number,#}).
zh_cn: '{'{0}@{7}'}' .{1} 将在 {4}({5}:{6,number,#}) 修改。

source: '|' block
zh_cn: '|' 块

source: '}' expected
zh_cn: 期望 '}'

source: ( expected
zh_cn: ( 是预期的

source: ( or entity ref or EMPTY or ANY expected
zh_cn: 期望 ( 或实体引用或 EMPTY 或 ANY

source: (INVALID)
zh_cn: (无效)

source: (Method will be made static and {0})
zh_cn: (方法将被静态化并 {0})

source: (Method will be made static)
zh_cn: (方法将被静态化)

source: (Method will be made {0})
zh_cn: (方法将 {0})

source: (Re)run
zh_cn: (重新)运行

source: (Re)run in Debug Mode
zh_cn: 在调试模式下(重新)运行
